---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Architecture.StairsPath
source: html/45353db8-9548-b44c-3668-5ae7e714e696.htm
---
# StairsPath Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.